Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool class enables the user to pick points, faces, segments and objects in the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.disposed
Indicates whether this instance has been disposed of.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.highlighter
The highlighter.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool class.
graphicsDrawer: The graphics drawer.
inputRange: The input range.
inputTypes: The input types.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker
Gets the picker.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.InputValidationRequested
Occurs when the user has tried to end the session before reaching the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange.Maximum.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.ObjectPicked
Occurs when an object has been picked.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.PreviewRequested
Occurs when the preview should be drawn.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.CustomSnappedPointRequested
Occurs when custom snapping becomes available.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.PickSessionEnded
Occurs when the tool is finished.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.PickSessionInterrupted
Occurs when the session gets interrupted by the DM platform.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.PickUndone
Occurs when the last pick should be undone.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.InputRange
Gets the input range.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.InputTypes
Gets the input types.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.StartPickingSession(System.String)
Starts the picking session.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Dispose


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Dispose(System.Boolean)
Releases unmanaged and - optionally - managed resources.
disposing: true to release both managed and unmanaged resources; false to release only unmanaged resources.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnPickEnding(System.Object,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputValidationEventArgs)
Event handler for the pick ending event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputValidationEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnPickEnded(System.Object,System.EventArgs)
Event handler for the pick ended event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnObjectPicked(System.Object,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs)
Event handler for the object picked event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnPreviewRequested(System.Object,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs)
Event handler for the preview requested event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnCustomSnappedPointRequested(System.Object,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs)
Event handler for the custom snapped point requested event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnPickUndone(System.Object,System.EventArgs)
Event handler for the pick undone event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.OnPickInterrupted(System.Object,System.EventArgs)
Event handler for the pick interrupted event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.Picker.
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.PickingTool.HighlightParts(System.Object,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs)
Highlights the currently tolerated parts.
sender: The sender.
eventArgs: The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs instance containing the event data.